@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /eval_string.texi/1.3/Sat Jun  2 00:13:21 2007//
@menu
* Funções e Variáveis Definidas para eval_string::
@end menu

@node Funções e Variáveis Definidas para eval_string,  , eval_string, eval_string
@section Funções e Variáveis Definidas para eval_string


@deffn {Função} eval_string (@var{str})
Entrega a seq@"{u}ência de caracteres do Maxima @var{str} como uma expressão do Maxima e a avalia.
@var{str} é uma seq@"{u}ência de caracteres do Maxima. Essa seq@"{u}ência pode ou não ter um marcador de final (sinal de dólar @code{$} ou ponto e vírgula @code{;}).
Somente a primeira expressão é entregue e avaliada, se ouver mais de uma.

Reclama se @var{str} não for uma seq@"{u}ência de caracteres do Maxima.

Exemplos:
@example
(%i1) eval_string ("foo: 42; bar: foo^2 + baz");
(%o1)                       42
(%i2) eval_string ("(foo: 42, bar: foo^2 + baz)");
(%o2)                   baz + 1764
@end example

Veja também @code{parse_string}.
@end deffn


@deffn {Função} parse_string (@var{str})
Entrega a seq@"{u}ência de caracteres do Maxima @var{str} como uma expressão do Maxima (sem fazer nenhuma avaliação dessa expressão).
@var{str} é uma seq@"{u}ência de caracteres do Maxima. Essa seq@"{u}ência pode ou não ter um marcador de final (sinal de dólar @code{$} ou ponto e vírgula @code{;}).
Somente a primeira expressão é entregue e avaliada, se ouver mais de uma.

Reclama se @var{str} não for uma seq@"{u}ência de caracteres do Maxima.

Exemplos:
@example
(%i1) parse_string ("foo: 42; bar: foo^2 + baz");
(%o1)                    foo : 42
(%i2) parse_string ("(foo: 42, bar: foo^2 + baz)");
                                    2
(%o2)          (foo : 42, bar : foo  + baz)
@end example

Veja também a função @code{eval_string}.
@end deffn

