@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /stirling.texi/1.2/Sat Jun  2 00:13:33 2007//
@menu
* Funções e Variáveis Definidas para stirling::
@end menu

@node Funções e Variáveis Definidas para stirling,  , stirling, stirling
@section Funções e Variáveis Definidas para stirling

@deffn {Função} stirling (@var{z},@var{n})
Substitui @code{gamma(x)} pela fórmula de Stirling @math{O(1/x^(2n-1))}. Quando @var{n} for
um inteiro estritamente negativo, sinaliza um erro.

Referência: Abramowitz & Stegun, " Handbook of mathematical functions", 6.1.40.

Exemplos:
@example
(%i1) load ("stirling")$

(%i2) stirling(gamma(%alpha+x)/gamma(x),1);
       1/2 - x             x + %alpha - 1/2
(%o2) x        (x + %alpha)
                                   1           1
                            --------------- - ---- - %alpha
                            12 (x + %alpha)   12 x
                          %e
(%i3) taylor(%,x,inf,1);
                    %alpha       2    %alpha
          %alpha   x       %alpha  - x       %alpha
(%o3)/T/ x       + -------------------------------- + . . .
                                 2 x
(%i4) map('factor,%);
                                       %alpha - 1
         %alpha   (%alpha - 1) %alpha x
(%o4)   x       + -------------------------------
                                  2
@end example

A função @code{stirling} conhece a diferença entre a variável @var{gamma} e
a função @code{gamma}:

@example
(%i5) stirling(gamma + gamma(x),0);
                                    x - 1/2   - x
(%o5)    gamma + sqrt(2) sqrt(%pi) x        %e
(%i6) stirling(gamma(y) + gamma(x),0);
                         y - 1/2   - y
(%o6) sqrt(2) sqrt(%pi) y        %e
                                              x - 1/2   - x
                         + sqrt(2) sqrt(%pi) x        %e
@end example

Para usar essa função escreva primeiro @code{load("stirling")}.
@end deffn

